app/controllers/messages_controller.rb

  def index
    	@message = Message.new
		  @messages = Message.all
      @current_user ||= User.find(session[:user_id])
---
SELECT "messages".* FROM "messages"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def create
    @current_user ||= User.find(session[:user_id])
    @message = Message.new(message_params)
    @message.sender = @current_user.first_name
    if @message.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("content", "sender", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello"], ["sender", "vlad"], ["created_at", "2016-01-05 11:26:39.652041"], ["updated_at", "2016-01-05 11:26:39.652041"]]

  def delete
    @messages = Message.all
    @messages.each do |message|
      Message.destroy(message)
---
SELECT "messages".* FROM "messages"
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 1]]

  def admin
    @current_user ||= User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]