app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "admin"], ["last_name", "admin"], ["email", "admin@admin.com"], ["password", "12345"], ["created_at", "2016-01-01 23:55:51.031387"], ["updated_at", "2016-01-01 23:55:51.031387"]]
---
  def create
    @user = User.new(user_params)

    @users = User.all
    if @users.count == 0
        @user.role = 'admin'
    end

    if @user.save